docs/AtomC_TD.md
```mermaid
stateDiagram-v2
    direction LR
    [*] --> s0

    s0 --> COMMA : ,
    s0 --> SEMICOLON : ;
    s0 --> LPAR : (
    s0 --> RPAR : )
    s0 --> LBRACKET : [
    s0 --> RBRACKET : ]
    s0 --> LACC : {
    s0 --> RACC : }
    s0 --> ADD : +
    s0 --> SUB : -
    s0 --> MUL : *
    s0 --> DOT : .
```
